import ezdxf

from PythonFiles.Development.NKY.NKY import NKY


class PreparationNKY:
    def __init__(self,data,msp,doc):
        self.data=data
        self.msp=msp
        self.doc=doc
        self.list_automat=["обычный  с магнитным пускателем","диф автомат резерв","обычный 380 резерв","обычный 220 резерв","резерв","диф автомат","обычный 380","обычный 220","обычный"]
        self.new_array=self.reorder_lists(self.convert_to_strings(self.data))
        self.get_index()
        # print(self.find_and_combine_elements(self.new_array))
        self.colums=self.transpose(self.new_array)
        self.partition_list=self.colums.pop(self.ind-1)
        self.split_list_by_index(self.find_and_combine_elements(self.new_array),self.ind)
        nk=NKY(self.msp,self.count1,self.count2,self.colums,self.doc,self.partition_list)

    def find_and_combine_elements(self,data):
        tip_automat = next((item[1:] for item in data if item[0] == "ТИП автомата"), None)
        # vid_kabelya = next((item[1:] for item in data if item[0] == "Вид кабеля"), None)
        # potrebiteli = next((item[1:] for item in data if item[0] == "Потребители"), None)
        result = []
        if tip_automat:
            result.append(tip_automat)
        # if vid_kabelya:
        #     result.append(vid_kabelya)
        # if potrebiteli:
        #     result.append(potrebiteli)
        return result[0]

    def split_list_by_index(self,lst, index):
        list_before = lst[:index-1]
        list_after = lst[index:]
        len1=len(list_before)
        len2=len(list_after)
        self.count1=0
        self.count2=0
        for i in list_before:
            if i.lower().replace("\n","") in self.list_automat:
                self.count1+=1
        for i in list_after:
            if i.lower().replace("\n","") in self.list_automat:
                self.count2+=1
        if len1+len2!=self.count1+self.count2:
            self.perebor()
        return list_before, list_after
    def convert_to_strings(self, nested_list):
        ar = [[str(item).replace("nan","").replace("None","")  for item in sublist] for sublist in nested_list]
        a = [self.remove_trailing_empty_strings(x) for x in ar]
        return a
    def perebor(self):
        self.delete_index=[]
        for i, elem in enumerate(self.colums[:-1]):
            if self.colums[i+1][1][0].lower().replace("\n","") not in self.list_automat:
                elem.append(self.colums[i+1][-1])
                self.delete_index.append(i+1)
        self.colums = [num for i, num in enumerate(self.colums) if i not in set(self.delete_index)]



    def get_index(self):
        for list in self.new_array:
            if "номер линии" in [str(item).lower() for item in list]:
                self.ind = list.index("ШС")



    def remove_trailing_empty_strings(self, strings):
        strings_copy = strings.copy()
        while strings_copy and strings_copy[-1] == "":
            strings_copy.pop()
        return strings_copy
    def transpose(self,matrix):
        trimmed_matrix = [row[1:] for row in matrix]
        transposed_matrix = list(map(list, zip(*trimmed_matrix)))
        for i,lst in enumerate(transposed_matrix):
            part1 = lst[:7]
            part2 = [i.lower().replace("\n","") for i in lst[7:10]]
            part3 = lst[10:]
            transposed_matrix[i]=[part1,part2,part3]
        return transposed_matrix
    def reorder_lists(self,list_of_lists):
        first_elements_dict = {sublist[0]: sublist for sublist in list_of_lists}
        reordered_list = []
        order=['Сборные шины\n Напряжение кВ Частота, Гц Ожидаемый ток трехфазного короткого замыкания на шинах НКУ/ток электродинамической стойкости',
               "Защитный аппарат:\n Количество фаз Номинальный ток In, А Уставка теплового расцепителя Ir, А Уставка токовой отсечки Isd, А / Характеристика автомата (B, C, D)","защитный аппарат","Аппарат на вводу 6(10) кВ",
               "Контактор:\n Номинальный ток, А Ток расцепителя, А","Маркировка-марка-сечение, мм2/ -длина, м \nтруба, длинна, м","Условное графическое изображение, \nобозначение","Марка сечения ","L длина","ТИП автомата",
               "Вид кабеля","Потребители"]
        for key in order:
            if key in first_elements_dict:
                reordered_list.append(first_elements_dict[key])
                del first_elements_dict[key]
        for sublist in list_of_lists:
            if sublist[0] in first_elements_dict:
                reordered_list.append(sublist)
        return reordered_list



if __name__ == "__main__":
    data=[['Сборные шины\n Напряжение кВ Частота, Гц Ожидаемый ток трехфазного короткого замыкания на шинах НКУ/ток электродинамической стойкости', '1QF', '2QF', '3QF', '4QF', '5QF', '6QF', '7QF', '8QF', '9QF', '10QF', '11QF', '12QF', '13QF', '14QF', '15QF', '3QF', '2QF1', '2QF2', '2QF3', '2QF4', '2QF5', '2QF6', '2QF7', '2QF8', '2QF9', '2QF10'],
['Защитный аппарат:\n Количество фаз Номинальный ток In, А Уставка теплового расцепителя Ir, А Уставка токовой отсечки Isd, А / Характеристика автомата (B, C, D)', 'текст', '3P', '3P', '3P', '3P', '3P', '3P', '3P', '3P', '3P', '3P', '3P', '3P', '3P', '3P', '3P', '3P', '3P', '3P', '3P', '3P', '3P', '3P', '3P', '3P', '3P'],
['Контактор:\n Номинальный ток, А Ток расцепителя, А', 'текст', 'Icu=50 кА', 'Icu=50 кА', 'Icu=50 кА', 'Icu=50 кА', 'Icu=50 кА', 'Icu=50 кА', 'Icu=50 кА', 'Icu=50 кА', 'Icu=50 кА', 'Icu=50 кА', 'Icu=50 кА', 'Icu=50 кА', 'Icu=50 кА', 'Icu=50 кА', 'Icu=50 кА', 'Icu=50 кА', 'Icu=50 кА', 'Icu=50 кА', 'Icu=50 кА', 'Icu=50 кА', 'Icu=50 кА', 'Icu=50 кА', 'Icu=50 кА', 'Icu=50 кА', 'Icu=50 кА'],
['Маркировка-марка-сечение, мм2/ -длина, м \nтруба, длинна, м', 'текст', 'In=100 A', 'In=100 A', 'In=100 A', 'In=100 A', 'In=100 A', 'In=100 A', 'In=100 A', 'In=100 A', 'In=100 A', 'In=100 A', 'In=100 A', 'In=100 A', 'In=100 A', 'In=100 A', 'In=100 A', 'In=100 A', 'In=100 A', 'In=100 A', 'In=100 A', 'In=100 A', 'In=100 A', 'In=100 A', 'In=100 A', 'In=100 A', 'In=100 A'],
['Условное графическое изображение, \nобозначение', 'текст', 'Isd=10lr=900A', 'Isd=10lr=900A', 'Isd=10lr=900A', 'Isd=10lr=900A', 'Isd=10lr=900A', 'Isd=10lr=900A', 'Isd=10lr=900A', 'Isd=10lr=900A', 'Isd=10lr=900A', 'Isd=10lr=900A', 'Isd=10lr=900A', 'Isd=10lr=900A', 'Isd=10lr=900A', 'Isd=10lr=900A', 'Ir=90 A', 'Isd=10lr=900A', 'Isd=10lr=900A', 'Isd=10lr=900A', 'Isd=10lr=900A', 'Isd=10lr=900A', 'Isd=10lr=900A', 'Isd=10lr=900A', 'Isd=10lr=900A', 'Isd=10lr=900A', 'Isd=10lr=900A'],
['Марка сечения ', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', 'Isd=10lr=900A', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст'],
['L длина', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', None, 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст'],
['ТИП автомата', 'обычный  с магнитным\n пускателем', 'диф \nавтомат', 'обычный \n380 резерв', 'обычный  с магнитным\n пускателем', 'обычный 220', 'обычный  с магнитным\n пускателем', 'диф \nавтомат', 'обычный \n380', 'обычный  с магнитным\n пускателем', 'обычный 220', 'обычный  с магнитным\n пускателем', 'диф \nавтомат', 'обычный \n380', 'обычный  с магнитным\n пускателем', 'обычный 220', None, 'обычный  с магнитным\n пускателем', 'диф \nавтомат', 'обычный \n380', 'обычный  с магнитным\n пускателем', 'обычный 220', 'обычный  с магнитным\n пускателем', 'диф \nавтомат резерв', 'обычный \n380', 'обычный  с магнитным\n пускателем', 'обычный 220'],
['Вид кабеля', '3 жильный с 0', '3 жильный с 0', '3 жильный с 0', '3 жильный с 0', '3 жильный с 0', '3 жильный с 0', '3 жильный с 0', '3 жильный с 0', '3 жильный с 0', '3 жильный с 0', '3 жильный с 0', '3 жильный с 0', '3 жильный с 0', '3 жильный с 0', '3 жильный с 0', None, '3 жильный с 0', '3 жильный с 0', '3 жильный с 0', '3 жильный с 0', '3 жильный с 0', '3 жильный с 0', '3 жильный с 0', '3 жильный с 0', '3 жильный с 0', '3 жильный с 0'],
['Потребители', 'Шкаф', 'Сх. У наружным освещением', 'Шкаф', 'Шкаф', 'Шкаф', 'Шкаф', 'Сх. У наружным освещением', 'Шкаф', 'Шкаф', 'Шкаф', 'Сх. У Э. двиг. С кнопочным постом', 'Шкаф', 'Шкаф', 'Шкаф', 'Шкаф', None, 'Сх. У Э. двиг. С кнопочным постом', 'Шкаф', 'Шкаф', 'Шкаф', 'Шкаф', 'Шкаф', 'Шкаф', 'Шкаф', 'Шкаф', 'Шкаф'],
['Номер линии', 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 'ШС', 16, 17, 18, 19, 20, 21, 22, 23, 24, 25],
['Установленная мощность, кВт', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', 'СВ', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст'],
['Расчетная мощность, кВт', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст'],
['Расчетный ток, А', 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 16, 17, 18, 19, 20, 'текст', 19, 20, 21, 22, 23, 24, 25, 26, 27, 28],
['Расчетная мощность в аварийном режиме, кВт', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст'],
['Расчетный ток в аварийном режиме, А', 'F4', 'F5', 'F6', 'F7', 'F8', 'F9', 'F10', 'F11', 'F12', 'F13', 'F12', 'F13', 'F14', 'F15', 'F16', 'текст', 'F14', 'F15', 'F16', 'F17', 'F18', 'F19', 'F20', 'F21', 'F22', 'F23'],
['Потеря напряжения до РУ/ЭП, %', 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 9, 10, 11, 12, 13, 'ШТ', 14, 15, 16, 17, 18, 19, 20, 21, 22, 23],
['Iкз 1ф в конце линии, А', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст'],
['Наименование, назначение\n', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', 'Секционный\n выключатель с\n АВР', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст'],
['Место установки, номер по генплану', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст'],
['Этап строительства', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст']]

    data2=[['Сборные шины\n Напряжение кВ Частота, Гц Ожидаемый ток трехфазного короткого замыкания на шинах НКУ/ток электродинамической стойкости', '1QF', '2QF', '3QF', '4QF', '5QF', '6QF', '7QF', "nan", '8QF', '9QF', '10QF', '11QF', '12QF', '13QF', '14QF', '15QF', '3QF', '2QF1', '2QF2', '2QF3', '2QF4', '2QF5', '2QF6', '2QF7', '2QF8', '2QF9', '2QF10'],
['Защитный аппарат:\n Количество фаз Номинальный ток In, А Уставка теплового расцепителя Ir, А Уставка токовой отсечки Isd, А / Характеристика автомата (B, C, D)', 'текст', '3P', '3P', '3P', '3P', '3P', '3P', "nan", '3P', '3P', '3P', '3P', '3P', '3P', '3P', '3P', '3P', '3P', '3P', '3P', '3P', '3P', '3P', '3P', '3P', '3P', '3P'],
['Контактор:\n Номинальный ток, А Ток расцепителя, А', 'текст', 'Icu=50 кА', 'Icu=50 кА', 'Icu=50 кА', 'Icu=50 кА', 'Icu=50 кА', 'Icu=50 кА', "nan", 'Icu=50 кА', 'Icu=50 кА', 'Icu=50 кА', 'Icu=50 кА', 'Icu=50 кА', 'Icu=50 кА', 'Icu=50 кА', 'Icu=50 кА', 'Icu=50 кА', 'Icu=50 кА', 'Icu=50 кА', 'Icu=50 кА', 'Icu=50 кА', 'Icu=50 кА', 'Icu=50 кА', 'Icu=50 кА', 'Icu=50 кА', 'Icu=50 кА', 'Icu=50 кА'],
['Маркировка-марка-сечение, мм2/ -длина, м \nтруба, длинна, м', 'текст', 'In=100 A', 'In=100 A', 'In=100 A', 'In=100 A', 'In=100 A', 'In=100 A', "nan", 'In=100 A', 'In=100 A', 'In=100 A', 'In=100 A', 'In=100 A', 'In=100 A', 'In=100 A', 'In=100 A', 'In=100 A', 'In=100 A', 'In=100 A', 'In=100 A', 'In=100 A', 'In=100 A', 'In=100 A', 'In=100 A', 'In=100 A', 'In=100 A', 'In=100 A'],
['Условное графическое изображение, \nобозначение', 'текст', 'Isd=10lr=900A', 'Isd=10lr=900A', 'Isd=10lr=900A', 'Isd=10lr=900A', 'Isd=10lr=900A', 'Isd=10lr=900A',"nan", 'Isd=10lr=900A', 'Isd=10lr=900A', 'Isd=10lr=900A', 'Isd=10lr=900A', 'Isd=10lr=900A', 'Isd=10lr=900A', 'Isd=10lr=900A', 'Isd=10lr=900A', 'Ir=90 A', 'Isd=10lr=900A', 'Isd=10lr=900A', 'Isd=10lr=900A', 'Isd=10lr=900A', 'Isd=10lr=900A', 'Isd=10lr=900A', 'Isd=10lr=900A', 'Isd=10lr=900A', 'Isd=10lr=900A', 'Isd=10lr=900A'],
['Марка сечения ', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', "nan", 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', 'Isd=10lr=900A', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст'],
['L длина', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', "nan", 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', "nan", 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст'],
['ТИП автомата', 'обычный  с магнитным\n пускателем', 'диф \nавтомат', 'обычный \n380 резерв', 'обычный  с магнитным\n пускателем', 'обычный 220', 'обычный  с магнитным\n пускателем', 'диф \nавтомат', "nan", 'обычный \n380', 'обычный  с магнитным\n пускателем', 'обычный 220', 'обычный  с магнитным\n пускателем', 'диф \nавтомат', 'обычный \n380', 'обычный  с магнитным\n пускателем', 'обычный 220', "nan", 'обычный  с магнитным\n пускателем', 'диф \nавтомат', 'обычный \n380', 'обычный  с магнитным\n пускателем', 'обычный 220', 'обычный  с магнитным\n пускателем', 'диф \nавтомат резерв', 'обычный \n380', 'обычный  с магнитным\n пускателем', 'обычный 220'],
['Вид кабеля', '3 жильный с 0', '3 жильный с 0', '3 жильный с 0', '3 жильный с 0', '3 жильный с 0', '3 жильный с 0', '3 жильный с 0', "nan", '3 жильный с 0', '3 жильный с 0', '3 жильный с 0', '3 жильный с 0', '3 жильный с 0', '3 жильный с 0', '3 жильный с 0', '3 жильный с 0', "nan", '3 жильный с 0', '3 жильный с 0', '3 жильный с 0', '3 жильный с 0', '3 жильный с 0', '3 жильный с 0', '3 жильный с 0', '3 жильный с 0', '3 жильный с 0', '3 жильный с 0'],
['Потребители', 'Шкаф', 'Сх. У наружным освещением', 'Шкаф', 'Шкаф', 'Шкаф', 'Шкаф', 'Сх. У наружным освещением', "nan", 'Шкаф', 'Шкаф', 'Шкаф', 'Сх. У Э. двиг. С кнопочным постом', 'Шкаф', 'Шкаф', 'Шкаф', 'Шкаф', "nan", 'Сх. У Э. двиг. С кнопочным постом', 'Шкаф', 'Шкаф', 'Шкаф', 'Шкаф', 'Шкаф', 'Шкаф', 'Шкаф', 'Шкаф', 'Шкаф'],
['Номер линии', 1, 2, 3, 4, 5, 6, 7, "nan", 8, 9, 10, 11, 12, 13, 14, 15, 'ШС', 16, 17, 18, 19, 20, 21, 22, 23, 24, 25],
['Установленная мощность, кВт', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', 'СВ', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст'],
['Расчетная мощность, кВт', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст'],
['Расчетный ток, А', 8, 9, 10, 11, 12, 13, 14, 15, 15, 16, 17, 16, 17, 18, 19, 20, 'текст', 19, 20, 21, 22, 23, 24, 25, 26, 27, 28],
['Расчетная мощность в аварийном режиме, кВт', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст'],
['Расчетный ток в аварийном режиме, А', 'F4', 'F5', 'F6', 'F7', 'F8', 'F9', 'F10', 'F11', 'F11', 'F12', 'F13', 'F12', 'F13', 'F14', 'F15', 'F16', 'текст', 'F14', 'F15', 'F16', 'F17', 'F18', 'F19', 'F20', 'F21', 'F22', 'F23'],
['Потеря напряжения до РУ/ЭП, %', 1, 2, 3, 4, 5, 6, 7, 8, 8, 9, 10, 9, 10, 11, 12, 13, 'ШТ', 14, 15, 16, 17, 18, 19, 20, 21, 22, 23],
['Iкз 1ф в конце линии, А', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст'],
['Наименование, назначение\n', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', 'Пост управления наружным освещением.\n\n', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', 'Секционный\n выключатель с\n АВР', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст'],
['Место установки, номер по генплану', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст'],
['Этап строительства', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст', 'текст']]
    doc = ezdxf.new("R2000")
    msp = doc.modelspace()
    pr=PreparationNKY(data2,msp,data)